#第一小问计算连加结果
# n=2
# c=0
# while n<=100:
#     c+=n*((-1)**n)
#     n+=1
# print(c)
#第二小问：输出 1,2,3,4,5, 7,8,9, 11,12
# n=1
# # while n<13:
# #     if n!=6 and n!=10:
# #         print(n)
# #     n+=1
#第三小问：输出100-50，从大到小，如100，99，98...，到50时再从0循环输出到50，然后结束
# n=100
# while n>50:
#     print(n)
#     n-=1
#     if n==50:
#         n=1
# else:
#     while n<=50:
#         print(n)
#         n+=1
#第四小问：输出 1-100 内的所有奇数
# n=1
# # while n<=100:
# #     if n%2==1:
# #         print(n)
# #     n+=1
#第五个小问题：输出 1-100 内的所有偶数
n=1
while n<=100:
   if n%2==0:
      print(n)
   n+=1